# Working  Data

## CORE-UA 109.01, Joanna Klukowska <br>

In [9]:
first = ["Joanna","Alice","Jason","Kate","Andrew","Seth"]
last = ["Smith","Brooks","White","Green","James","Ziminski","Argh"]
salaries = []
for i in range(0,10):
    x = random.randint(10000,200000)
    salaries.append(x)
print (salaries)

[65399, 16834, 145514, 149660, 11768, 63552, 27891, 199478, 51053, 96237]

In [3]:
def create_person(first, last, salaries):
    return {'first':first[random.randint(0,len(first)-1)], 
            'last':last[random.randint(0,len(last)-1)],
            'salary':salaries[random.randint(0,len(salaries)-1)] 
           }

In [4]:
create_person(first, last, salaries)

{'first': 'Andrew', 'last': 'Brooks', 'salary': 134937}

In [10]:
dataset = []
for i in range(0,10):
    dataset.append(create_person(first, last, salaries))

In [11]:
print(dataset)

[{'first': 'Andrew', 'last': 'Smith', 'salary': 120250}, {'first': 'Seth', 'last': 'Argh', 'salary': 116151}, {'first': 'Seth', 'last': 'Argh', 'salary': 110989}, {'first': 'Andrew', 'last': 'Green', 'salary': 137383}, {'first': 'Alice', 'last': 'Ziminski', 'salary': 137383}, {'first': 'Seth', 'last': 'Argh', 'salary': 120250}, {'first': 'Alice', 'last': 'James', 'salary': 77873}, {'first': 'Alice', 'last': 'Argh', 'salary': 20612}, {'first': 'Andrew', 'last': 'Green', 'salary': 120250}, {'first': 'Joanna', 'last': 'White', 'salary': 134937}]

In [12]:
for i in range(0,10):
    person = dataset[i]
    person['first']
    print(format(person['last'],'20s'), 
          format(person['first'],'20s'),
          format(person['salary'],'10,.2f'), 
          sep='')

Smith               Andrew              120,250.00
Argh                Seth                116,151.00
Argh                Seth                110,989.00
Green               Andrew              137,383.00
Ziminski            Alice               137,383.00
Argh                Seth                120,250.00
James               Alice                77,873.00
Argh                Alice                20,612.00
Green               Andrew              120,250.00
White               Joanna              134,937.00

In [ ]:

import pandas as pd

In [15]:
data_frame = pd.DataFrame(dataset,columns=["first","last","salary"])

In [17]:
data_frame

    first      last  salary
0  Andrew     Smith  120250
1    Seth      Argh  116151
2    Seth      Argh  110989
3  Andrew     Green  137383
4   Alice  Ziminski  137383
5    Seth      Argh  120250
6   Alice     James   77873
7   Alice      Argh   20612
8  Andrew     Green  120250
9  Joanna     White  134937

In [21]:
data_frame["salary"]

0    120250
1    116151
2    110989
3    137383
4    137383
5    120250
6     77873
7     20612
8    120250
9    134937
Name: salary, dtype: int64

In [23]:
data_frame["last"][3]

'Green'

In [29]:
print(data_frame['salary'].mean())
print(data_frame['salary'].median())
print(data_frame['salary'].mode())

109607.8
120250.0
0    120250
dtype: int64